package com.company.autocatalog.constans;

public final class Constants {

    public static final String NAME_ID = "ID";
    public static final String NAME_BRAND = "Марка";
    public static final String NAME_MODEL = "Модель";
    public static final String NAME_CATEGORY = "Категория ТС";
    public static final String NAME_TYPE = "Тип ТС";
    public static final String NAME_REGISTRATION_NUMBER = "Гос. номер";
    public static final String NAME_MANUFACTURING_YEAR = "Год выпуска";
    public static final String NAME_CAR_TRAILER = "Наличие прицепа";

    public static final String [] LIST_TYPE = new String[]
            {
            "100 - Водное судно",
            "201 - Паровоз",
            "202 - Электровоз",
            "203 - Электропоезд",
            "204 - Тепловоз",
            "205 - Дизель-поезд",
            "206 - Путевая машина",
            "207 - Вагон пассажирский",
            "208 - Вагон багажный",
            "209 - Вагон изотермический",
            "210 - Цистерна",
            "211 - Полувагон",
            "212 - Платформа",
            "298 - Прочий вагон",
            "301 - Легковой автомобиль общего назначения",
            "302 - Специальный легковой автомобиль",
            "303 - Грузовой автомобиль общего назначения",
            "304 - Специальный грузовой автомобиль",
            "305 - Грузопассажирский автомобиль",
            "306 - Автомобиль-тягач",
            "307 - Седельный тягач",
            "308 - Пассажирский прицеп, технически допустимая максимальная масса которого не более 0,75 т",
            "309 - Пассажирский прицеп, технически допустимая максимальная масса которого свыше 0,75 т, но не более 3,5 т",
            "310 - Пассажирский прицеп, технически допустимая максимальная масса которого свыше 3,5 т, но не более 10 т",
            "311 - Пассажирский прицеп, технически допустимая максимальная масса которого более 10 т",
            "312 - Грузовой прицеп общего назначения" ,
            "313 - Специальный прицеп" ,
            "314 - Караван",
            "315 - Пассажирский полуприцеп, технически допустимая максимальная масса которого не более 0,75 т",
            "316 - Пассажирский полуприцеп, технически допустимая максимальная масса которого свыше 0,75 т, но не более 3,5 т",
            "317 - Пассажирский полуприцеп, технически допустимая максимальная масса которого свыше 3,5 т, но не более 10 т",
            "318 - Пассажирский полуприцеп, технически допустимая максимальная масса которого более 10 т",
            "319 - Грузовой полуприцеп общего назначения" ,
            "320 - Специальный полуприцеп",
            "321 - Автобус общего назначения",
            "322 - Специальный автобус",
            "323 - Сочлененный автобус",
            "324 - Микроавтобус",
            "400 - Воздушное судно",
            "901 - Контейнер",
            "999 - Прочее транспортное средство"
            };

    public static final String [] LIST_CATEGORY = new String[]
            {
                    "L1",
                    "L2",
                    "L3",
                    "L4",
                    "L5",
                    "L6",
                    "L7",
                    "M1",
                    "M2",
                    "M3",
                    "N1",
                    "N2",
                    "N3",
                    "O1",
                    "O2",
                    "O3",
                    "O4"
            };


    private Constants() {}
}
